package ek.ja.kanji;

import java.util.HashSet;
import java.util.Set;

public class KanjiLists
{
    public static String GRADE_1
        = "一二三四五六七八九十百千日月火水木金土下上左右大中小手足目耳口人子女男名年山川森林田空雨天気夕花草竹"
        + "犬虫貝石王玉力糸車音学校先生字文本村町白赤青円正早入出立休見";
    
    public static String GRADE_2
        = "春夏秋冬光風晴雲雪朝昼夜午明星野原岩谷海池公園西南東北時分週曜今元間親母兄父弟姉妹自友体毛頭顔声心首"
        + "思考才言記話書読聞語算国数理科社会図画工作歌絵楽色紙黄黒形点丸線合直角計何答電教知万毎回番半当組交通"
        + "道場地方京市里寺店家門室戸台汽船弓矢刀馬魚牛鳥鳴羽肉米麦茶食活用前後内外遠近多少古新太細強弱長高広同"
        + "歩走行来帰止売買引切";

    public static String GRADE_3
        = "悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起究期客急級宮球去橋業曲局銀区苦係具君軽血決研"
        + "県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神"
        + "真深進世昔全整相送想息速族他打対待代第炭短題談着注柱丁帳調追定庭笛都鉄転度投豆島湯登等動童農波配畑倍"
        + "箱発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和";
    
    public static String GRADE_4
        = "愛案以衣位囲胃印英栄塩億加果課芽貨改械害街各覚完官管関観季願希紀喜旗器機議求泣救給挙漁鏡共協競極訓軍"
        + "郡径型景芸欠結建固健験功好候航康告差菜最材昨札刷察参殺産散残士氏史司試児治辞種失借周祝順初松笑唱焼象"
        + "照賞臣省信成清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲貯兆腸底停低的典伝徒努灯堂働特得毒熱敗"
        + "梅念博飯飛費必票標不夫付府兵副粉別辺変便包法望牧末満未脈約民無勇要養浴利陸良料量輪類令歴冷例連老労録";

    public static String GRADE_5
        = "圧移因永営衛易益液演応往桜恩可仮価河過賀快解格確額刊眼幹慣基寄規技義逆久旧居許境均句群禁経潔件券険検"
        + "限現減故個効厚護耕鉱構興講混査再災妻採際在財罪雑酸賛支志枝師資飼識示似質舎謝授修述術準序招承状証条常"
        + "情織職制性政勢精製税責接設績舌絶銭祖素総造像増則測属率損退貸態団断築張提程適敵統銅導徳独任燃能破犯判"
        + "版比肥非備俵評貧布婦富武復複仏編墓弁保報豊防貿暴務夢迷綿輸余預容略留領";

    public static String GRADE_6
        = "異遺域宇映延沿我灰拡革閣株干割巻看簡危机揮貴疑吸郷供胸勤筋系敬警劇激穴絹権憲厳源己呼誤后孝皇紅降鋼刻"
        + "穀骨困砂座済裁策冊蚕至私姿誌視詞磁射捨尺若樹収宗就衆従縦縮熟純処署諸除将傷障城蒸仁針垂推寸盛聖誠宣専"
        + "泉洗染善奏窓創装層操蔵臓存尊宅担誕段探暖値宙忠著庁頂潮賃痛展討党糖届難乳認納脳派拝俳背肺班晩否批秘腹"
        + "奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳優幼郵欲翌乱卵覧裏律臨朗論";

    
    public static Set<Character> createCharSet(String str)
    {
        Set<Character> set = new HashSet<>(str.length());
        for(int i = 0; i < str.length(); i++)
        {
            set.add(str.charAt(i));
        }
        
        return set;
    }
}
