package ek.ja.kanji;

import java.util.Set;

public class KanjiLists
{
    public static String GRADE_1
        = "一二三四五六七八九十百千日月火水木金土下上左右大中小手足目耳口人子女男名年山川森林田空雨天気夕花草竹"
        + "犬虫貝石王玉力糸車音学校先生字文本村町白赤青円正早入出立休見";
    
    public static String GRADE_2
        = "春夏秋冬光風晴雲雪朝昼夜午明星野原岩谷海池公園西南東北時分週曜今元間親母兄父弟姉妹自友体毛頭顔声心首"
        + "思考才言記話書読聞語算国数理科社会図画工作歌絵楽色紙黄黒形点丸線合直角計何答電教知万毎回番半当組交通"
        + "道場地方京市里寺店家門室戸台汽船弓矢刀馬魚牛鳥鳴羽肉米麦茶食活用前後内外遠近多少古新太細強弱長高広同"
        + "歩走行来帰止売買引切";

    public static String GRADE_3
        = "悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起究期客急級宮球去橋業曲局銀区苦係具君軽血決研"
        + "県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神"
        + "真深進世昔全整相送想息速族他打対待代第炭短題談着注柱丁帳調追定庭笛都鉄転度投豆島湯登等動童農波配畑倍"
        + "箱発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和";
    
    public static String GRADE_4
        = "愛案以衣位囲胃印英栄塩億加果課芽貨改械害街各覚完官管関観季願希紀喜旗器機議求泣救給挙漁鏡共協競極訓軍"
        + "郡径型景芸欠結建固健験功好候航康告差菜最材昨札刷察参殺産散残士氏史司試児治辞種失借周祝順初松笑唱焼象"
        + "照賞臣省信成清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲貯兆腸底停低的典伝徒努灯堂働特得毒熱敗"
        + "梅念博飯飛費必票標不夫付府兵副粉別辺変便包法望牧末満未脈約民無勇要養浴利陸良料量輪類令歴冷例連老労録";

    public static String GRADE_5
        = "圧移因永営衛易益液演応往桜恩可仮価河過賀快解格確額刊眼幹慣基寄規技義逆久旧居許境均句群禁経潔件券険検"
        + "限現減故個効厚護耕鉱構興講混査再災妻採際在財罪雑酸賛支志枝師資飼識示似質舎謝授修述術準序招承状証条常"
        + "情織職制性政勢精製税責接設績舌絶銭祖素総造像増則測属率損退貸態団断築張提程適敵統銅導徳独任燃能破犯判"
        + "版比肥非備俵評貧布婦富武復複仏編墓弁保報豊防貿暴務夢迷綿輸余預容略留領";

    public static String GRADE_6
        = "異遺域宇映延沿我灰拡革閣株干割巻看簡危机揮貴疑吸郷供胸勤筋系敬警劇激穴絹権憲厳源己呼誤后孝皇紅降鋼刻"
        + "穀骨困砂座済裁策冊蚕至私姿誌視詞磁射捨尺若樹収宗就衆従縦縮熟純処署諸除将傷障城蒸仁針垂推寸盛聖誠宣専"
        + "泉洗染善奏窓創装層操蔵臓存尊宅担誕段探暖値宙忠著庁頂潮賃痛展討党糖届難乳認納脳派拝俳背肺班晩否批秘腹"
        + "奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳優幼郵欲翌乱卵覧裏律臨朗論";

    public static String GRADE_S
        = "亜哀挨曖握扱宛嵐依威為畏尉萎偉椅彙違維慰緯壱逸茨芋咽姻淫陰隠韻唄鬱畝浦詠影鋭疫悦越謁閲炎怨宴媛援煙猿"
        + "鉛縁艶汚凹押旺欧殴翁奥岡憶臆虞乙俺卸穏佳苛架華菓渦嫁暇禍靴寡箇稼蚊牙瓦雅餓介戒怪拐悔皆塊楷潰壊懐諧劾"
        + "崖涯慨蓋該概骸垣柿核殻郭較隔獲嚇穫岳顎掛潟括喝渇葛滑褐轄且釜鎌刈甘汗缶肝冠陥乾勘患貫喚堪換敢棺款閑勧"
        + "寛歓監緩憾還環韓艦鑑含玩頑企伎岐忌奇祈軌既飢鬼亀幾棋棄毀畿輝騎宜偽欺儀戯擬犠菊吉喫詰却脚虐及丘朽臼糾"
        + "嗅窮巨拒拠虚距御凶叫狂享況峡挟狭恐恭脅矯響驚仰暁凝巾斤菌琴僅緊錦謹襟吟駆惧愚偶遇隅串屈掘窟熊繰勲薫刑"
        + "茎契恵啓掲渓蛍傾携継詣慶憬稽憩鶏迎鯨隙撃桁傑肩倹兼剣拳軒圏堅嫌献遣賢謙鍵繭顕懸幻玄弦舷股虎孤弧枯雇誇"
        + "鼓錮顧互呉娯悟碁勾孔巧甲江坑抗攻更拘肯侯恒洪荒郊香貢控梗喉慌硬絞項溝綱酵稿衡購乞拷剛傲豪克酷獄駒込頃"
        + "昆恨婚痕紺魂墾懇佐沙唆詐鎖挫采砕宰栽彩斎債催塞歳載埼剤崎削柵索酢搾錯咲刹拶撮擦桟惨傘斬暫旨伺刺祉肢施"
        + "恣脂紫嗣雌摯賜諮侍滋慈餌璽鹿軸𠮟疾執湿嫉漆芝赦斜煮遮邪蛇酌釈爵寂朱狩殊珠腫趣寿呪需儒囚舟秀臭袖羞愁酬"
        + "醜蹴襲汁充柔渋銃獣叔淑粛塾俊瞬旬巡盾准殉循潤遵庶緒如叙徐升召匠床抄肖尚昇沼宵症祥称渉紹訟掌晶焦硝粧詔"
        + "奨詳彰憧衝償礁鐘丈冗浄剰畳縄壌嬢錠譲醸拭殖飾触嘱辱尻伸芯辛侵津唇娠振浸紳診寝慎審震薪刃尽迅甚陣尋腎須"
        + "吹炊帥粋衰酔遂睡穂随髄枢崇据杉裾瀬是井姓征斉牲凄逝婿誓請醒斥析脊隻惜戚跡籍拙窃摂仙占扇栓旋煎羨腺詮践"
        + "箋潜遷薦繊鮮禅漸膳繕狙阻租措粗疎訴塑遡礎双壮荘捜挿桑掃曹曽爽喪痩葬僧遭槽踪燥霜騒藻憎贈即促捉俗賊遜汰"
        + "妥唾堕惰駄耐怠胎泰堆袋逮替滞戴滝択沢卓拓託濯諾濁但脱奪棚誰丹旦胆淡嘆端綻鍛弾壇恥致遅痴稚緻畜逐蓄秩窒"
        + "嫡沖抽衷酎鋳駐弔挑彫眺釣貼超跳徴嘲澄聴懲勅捗沈珍朕陳鎮椎墜塚漬坪爪鶴呈廷抵邸亭貞帝訂逓偵堤艇締諦泥摘"
        + "滴溺迭哲徹撤添塡殿斗吐妬途渡塗賭奴怒到逃倒凍唐桃透悼盗陶塔搭棟痘筒稲踏謄藤闘騰洞胴瞳峠匿督篤栃凸突屯"
        + "豚頓貪鈍曇丼那奈梨謎鍋軟尼弐匂虹尿妊忍寧捻粘悩濃把覇婆罵杯排廃輩培陪媒賠伯拍泊迫剝舶薄漠縛爆箸肌鉢髪"
        + "伐抜罰閥氾帆汎伴阪畔般販斑搬煩頒範繁藩蛮盤妃彼披卑疲被扉碑罷避尾眉微膝肘匹泌姫漂苗描猫浜賓頻敏瓶扶怖"
        + "阜附訃赴浮符普腐敷膚賦譜侮舞封伏幅覆払沸紛雰噴墳憤丙併柄塀幣弊蔽餅壁璧癖蔑偏遍哺捕舗募慕簿芳邦奉抱泡"
        + "胞俸倣峰砲崩蜂飽褒縫乏忙坊妨房肪某冒剖紡傍帽貌膨謀頰朴睦僕墨撲没勃堀奔翻凡盆麻摩磨魔昧埋膜枕又抹慢漫"
        + "魅岬蜜妙眠矛霧娘冥銘滅免麺茂妄盲耗猛網黙紋冶弥厄躍闇喩愉諭癒唯幽悠湧猶裕雄誘憂融与誉妖庸揚揺溶腰瘍踊"
        + "窯擁謡抑沃翼拉裸羅雷頼絡酪辣濫藍欄吏痢履璃離慄柳竜粒隆硫侶虜慮了涼猟陵僚寮療瞭糧厘倫隣瑠涙累塁励戻鈴"
        + "零霊隷齢麗暦劣烈裂恋廉錬呂炉賂露弄郎浪廊楼漏籠麓賄脇惑枠湾腕";
    
    public static void appendCharSet(Set<Character> set, String str)
    {
        for(int i = 0; i < str.length(); i++)
        {
            set.add(str.charAt(i));
        }
    }
}
